import pandas as pd
import numpy as np
import sys

#初始化df
df_init=pd.read_excel(f'E:/PythonStudy_Git/调用资料/file/菜品报表.xlsx',sheet_name = 0)

cai_index=(('1','2020-09-01'),
	('2','2020-09-02'),
	('3','2020-09-03'),
	('4','2020-09-04'),
	('5','2020-09-05'),
	('6','2020-09-06'),
	('7','2020-09-08'),
	('8','2020-09-09'),
	('9','2020-09-10'),
	('10','2020-09-11'),
	('11','2020-09-12'),
	('12','2020-09-13'),
	('13','2020-09-15'),
	('14','2020-09-16'),
	('15','2020-09-17'),
	('16','2020-09-18'),
	('17','2020-09-19'),
	('18','2020-09-20'),
	('19','2020-09-22'),
	('20','2020-09-23'),
	('21','2020-09-24'),
	('22','2020-09-25'),
	('23','2020-09-26'),
	('24','2020-09-27'),
	('25','2020-09-28'),
	('26','2020-09-29'),
	)
for i in cai_index:
	#逐个打开表,并增加时间列
	df=pd.read_excel(f'E:/PythonStudy_Git/调用资料/file/菜品报表 ({i[0]}).xlsx',sheet_name = 0)
	#增加时间
	df['时间']=i[1]
	df_init=pd.merge(df_init,df,how="outer")

# print(cai_index)
# print(df_init)#测试
df_init.to_excel('E:/pyNote/调用资料/菜品报表1111.xlsx','Sheet1')
